<?php 

// Задача №1. Написать калькуляторы перевода
//Калькулятор без if else, так что слова тут не склоняются.
//Имена переменных величин, названы в соответствии с их официальным обозначением.

echo 'Задача №1' . '<br>';

// 1. Дюймы в сантиметры
$in = 1;
$sm = $in * 2.54;
echo $in . ' дюйм = ' . $sm . ' сантиметров' . '<br>';

//2. Дюймы в метры
$in = 1;
$m = $in * 0.0254;
echo $in . ' дюйм = ' . $m . ' метров' . '<br>';

//3. Мили в км
$mi = 1;
$km = $mi * 1.6;
echo $mi . ' миля = ' . $km . ' милометров' . '<br>';

//4. Мили в метры
$mi = 1;
$m = $mi * 1609;
echo $mi . ' миля = ' . $m . ' метров' . '<br>';

//5. Градусы цельсия в Фаренгейты
$c = 1;
$f = $c * 33.8;
echo $c . ' Цельсий = ' . $f . ' Фаренгейта' . '<br>';

//6. Фаренгейты в градусы Цельсия
$f = 1;
$c = $f * 0.0295;
echo $f . ' Фаренгейт = ' . $c . ' Цельсий' . '<br>';

//7. Морские мили в км
$nm = 1;
$km = $nm * 1.852;
echo $f . ' Морская Миля = ' . $c . ' километров' . '<br>';

//8. Километры в сантиметры
$km = 1;
$sm = $km * 100000;
echo $km . ' километр = ' . $sm . ' сантиметров' . '<br>';

//9. Футы в метры
$ft = 1;
$m = $ft * 0.3048;
echo $ft . ' фут = ' . $m . ' метров' . '<br>';

//10. Галлон (англ) в литры
$gal = 1;
$liter = $gal * 4.54608;
echo $gal . ' галлон (UK) = ' . $liter . ' литров' . '<br>';



// Задача №2 ------------------------------------------------
echo '<br>' . '<br>';
echo 'Задача №2' . '<br>';

$s = 2; //пройденный путь, км
$t = 1; //время движения, час
$v = $s / $t; // расчет скорости
echo 'Скорость машины ' . $v . ' км/ч или ' . $v * 0.28 . ' м/c' . '<br>';



// Задача №3 ------------------------------------------------
echo '<br>' . '<br>';
echo 'Задача №3' . '<br>';

$a = 10;
$b = 3;
$res = $a % $b;
echo 'Остаток от деления ' . $a . ' на ' . $b . ' = ' . $res . '<br>';



// Задача №4 ------------------------------------------------
echo '<br>' . '<br>';
echo 'Задача №4' . '<br>';

echo pow(2, 10) . '<br>';
echo sqrt(245) . '<br>';



// Задача №5 ------------------------------------------------
echo '<br>' . '<br>';
echo 'Задача №5' . '<br>';

echo 'Текущая дата ' . date("d/m/Y") . '<br>';



// Задача №6 ------------------------------------------------
echo '<br>' . '<br>';
echo 'Задача №6' . '<br>';

$num1 = 100;
$num2 = 200;
$num3 = 300;
$num4 = 400;
$num5 = 500;

$res1 = $num1 * 0.1;
$res2 = $num2 * 0.2;
$res3 = $num3 * 0.3;
$res4 = $num4 * 0.4;
$res5 = $num5 * 0.5;

$mainRes = $res1 + $res2 + $res3 + $res4 + $res5;
echo $mainRes . '<br>';



// Задача №7 ------------------------------------------------
echo '<br>' . '<br>';
echo 'Задача №7' . '<br>';

$number = 20;
$res1 = $number * 0.01 + 1;
echo $res1 . '<br>';

$koef = 1.2;
$res2 = ($koef - 1) * 100;
echo $res2 . '<br>';

 ?>